src/InformationRegisters/СпецификацииПС/СпецификацииПС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпецификацииПС</name>
  <resources>
    <name>ЗИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВЗИПБорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВЗИПБаза</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВЗИПДЭ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВЗИПР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПозиции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тип</name>
    <type>
      <types>CatalogRef.РазделыСпецификацииЗИП</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаВыбораДляЗИП</name>
    <type>
      <types>CatalogRef.ПричиныВыбораПредметаСнабженияДляЗИП</types>
    </type>
  </resources>
  <attributes>
    <name>ОбозначениеСНК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПредметСнабжения</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СоставляющаяЧасть</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/СпецификацииПредметовСнабженияПовтИсп/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапросаДляСпецификацииПрямой() Экспорт
	
	КоличествоЦиклов = Константы.МаксимальноеКоличествоУровнейВложенностиСпецификации.Получить();
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СпецификацииПС.ПредметСнабжения КАК ПредметСнабжения,
	|	СпецификацииПС.СоставляющаяЧасть КАК СоставляющаяЧасть,
	|	СпецификацииПС.ЗИП КАК ЗИП,
	|	СпецификацииПС.Количество КАК Количество,
	|	СпецификацииПС.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
	|	СпецификацииПС.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
	|	СпецификацииПС.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ,
	|	СпецификацииПС.КоличествоВЗИПР КАК КоличествоВЗИПР,
	|	СпецификацииПС.НомерПозиции КАК НомерПозиции,
	|	СпецификацииПС.Тип КАК Тип
	|ПОМЕСТИТЬ ВТ_1
	|ИЗ
	|	РегистрСведений.СпецификацииПС КАК СпецификацииПС
	|ГДЕ
	|	СпецификацииПС.ПредметСнабжения = &ПредметСнабжения
	|;";
	
	Для Н = 1 По КоличествоЦиклов - 1 Цикл
		
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	ВТ_" + Н + ".СоставляющаяЧасть КАК ПредметСнабжения,
		|	СпецификацииПС.СоставляющаяЧасть КАК СоставляющаяЧасть,
		|	СпецификацииПС.ЗИП КАК ЗИП,
		|	СпецификацииПС.Количество КАК Количество,
		|	СпецификацииПС.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
		|	СпецификацииПС.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
		|	СпецификацииПС.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ,
		|	СпецификацииПС.КоличествоВЗИПР КАК КоличествоВЗИПР,
		|	СпецификацииПС.НомерПозиции КАК НомерПозиции,
		|	СпецификацииПС.Тип КАК Тип		
		|ПОМЕСТИТЬ ВТ_" + (Н + 1) + "
		|ИЗ
		|	ВТ_" + Н + " КАК ВТ_" + Н + "
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СпецификацииПС КАК СпецификацииПС
		|		ПО ВТ_" + Н + ".СоставляющаяЧасть = СпецификацииПС.ПредметСнабжения
		|;
		|";
		
	КонецЦикла;	
	
	СтрокаОбъединитьВсе = "";
	СтрокаПоместить = "ПОМЕСТИТЬ ВТ_Спецификация";
	
	Для Н = 1 По КоличествоЦиклов Цикл
		
		ТекстЗапроса = ТекстЗапроса + СтрокаОбъединитьВсе + "
		|
		|ВЫБРАТЬ
		|	ВТ_" + Н + ".ПредметСнабжения КАК ПредметСнабжения,
		|	ВТ_" + Н + ".СоставляющаяЧасть КАК СоставляющаяЧасть,
		|	ВТ_" + Н + ".ЗИП КАК ЗИП,
		|	ВТ_" + Н + ".Количество КАК Количество,
		|	ВТ_" + Н + ".КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
		|	ВТ_" + Н + ".КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
		|	ВТ_" + Н + ".КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ,
		|	ВТ_" + Н + ".КоличествоВЗИПР КАК КоличествоВЗИПР,
		|	ВТ_" + Н + ".НомерПозиции КАК НомерПозиции,
		|	ВТ_" + Н + ".Тип КАК Тип
		
		|" + СтрокаПоместить + "
		|ИЗ
		|	ВТ_" + Н + " КАК ВТ_" + Н + "
		|
		|";
		
		СтрокаПоместить = "";
		СтрокаОбъединитьВсе = "ОБЪЕДИНИТЬ ВСЕ";

	КонецЦикла;	
	
	Для Н = 1 По КоличествоЦиклов Цикл
		
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|
		|УНИЧТОЖИТЬ ВТ_" + Н + "
		|
		|";
		
		СтрокаОбъединитьВсе = "ОБЪЕДИНИТЬ ВСЕ";

	КонецЦикла;	

	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаДляСпецификацииПрямой()

Функция ПолучитьТекстЗапросаДляСпецификации() Экспорт
	
	ТекстЗапроса = ПолучитьТекстЗапросаДляСпецификацииПрямой();

	ТекстЗапроса = ТекстЗапроса + "
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Спецификация.ПредметСнабжения КАК ПредметСнабжения,
	|	ВТ_Спецификация.СоставляющаяЧасть КАК СоставляющаяЧасть,
	|	ВТ_Спецификация.ЗИП КАК ЗИП,
	|	ВТ_Спецификация.Количество КАК Количество,
	|	ВТ_Спецификация.КоличествоВЗИПБорт КАК КоличествоВЗИПБорт,
	|	ВТ_Спецификация.КоличествоВЗИПБаза КАК КоличествоВЗИПБаза,
	|	ВТ_Спецификация.КоличествоВЗИПДЭ КАК КоличествоВЗИПДЭ,
	|	ВТ_Спецификация.КоличествоВЗИПР КАК КоличествоВЗИПР,
	|	ВТ_Спецификация.НомерПозиции КАК НомерПозиции,
	|	ВТ_Спецификация.Тип КАК Тип
	|ИЗ
	|	ВТ_Спецификация КАК ВТ_Спецификация
	|
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстЗапросаДляСпецификации()

#КонецОбласти
